# CC_RoomFromShape

## Description
Creates layout room from the given shape. The shape must be rectangle, rounded rectangle, polygon or polyline. Returns the handle of the created room.

```pascal
FUNCTION CC_RoomFromShape(hObj : HANDLE) : HANDLE;
```

```python

def vs.CC_RoomFromShape(hObj):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||

## Version
Availability: from Vectorworks 2022.3
## Category
* ConnectCAD